""" Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

Примеры:
- 1, 4, 8, 7, 5 -> 8
- 78, 55, 36, 90, 2 -> 90 """

maxx = int(input('Введите число: '))
for _ in range(4):
    n = int(input('Введите число: '))
    if n > maxx:
        maxx = n
print(maxx)