""" Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части числа.
    
    *Примеры:*
    
    - 6,78 -> 7
    - 5 -> нет
    - 0,34 -> 3 """

""" a = float(input())
if a % 1 == 0:
    print('no')
else:
    print(int(a*10) % 10)
 """

a = input()
if '.' in a:
    print(a[a.index('.') + 1])
elif ',' in a:
    print(a[a.index(',') + 1])
else:
    print('нет')
