""" Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

Примеры:
- 1, 4, 8, 7, 5 -> 8
- 78, 55, 36, 90, 2 -> 90 """

def ismax(a, b, c, d, e): 

    result = max(a, b, c, d, e)
    print(result)

ismax(1, 2, 3, 4, 5)


